In [1]:
import pandas as pd
import numpy as np

### Load and merge dataset with Shanghai ARWU ranking

In [2]:
universityDataRawDf = pd.read_csv('./universities_data_raw.csv')
universityRankingDf = pd.read_csv('./shanghai_ranking.csv', names=['Ranking', 'Name'])

In [3]:
universityDataMergedDf = pd.merge(universityDataRawDf, universityRankingDf, on='Name', how='left')
universityDataMergedDf.shape

(1534, 146)

### Drop and rename columns

In [4]:
universityDataMergedDf = universityDataMergedDf[['Name', 'Applicants total', 'Enrolled total', 'Tuition and fees, 2013-14',
                                                 'Total price for out-of-state students living on campus 2013-14', 'Ranking']]

universityDataDf = universityDataMergedDf.rename(columns={'Tuition and fees, 2013-14': 'Tuition and fees',
                   'Total price for out-of-state students living on campus 2013-14':
                   'Costs of living on campus'})

universityDataDf.head(5)

,Name,Applicants total,Enrolled total,Tuition and fees,Costs of living on campus,Ranking
0,Alabama A & M University,6142.0,1104.0,7182.0,27441.0,NaN
1,University of Alabama at Birmingham,5689.0,1773.0,7206.0,31687.0,301-400
2,Amridge University,NaN,NaN,6870.0,NaN,NaN
3,University of Alabama in Huntsville,2054.0,651.0,9192.0,35780.0,NaN
4,Alabama State University,10245.0,1479.0,8720.0,25222.0,NaN

### Fill rankings for universities not in Shanghai ranking

In [5]:
universityDataDf['Ranking'] = universityDataDf['Ranking'].fillna('1000+')
universityDataDf['Ranking display'] = np.where(universityDataDf['Ranking'] == '1000+', '1000+', 'top 1000')

universityDataDf['Ranking display'].value_counts()

Ranking display
1000+       1420
top 1000     114
Name: count, dtype: int64

### Drop rows with NaN values

In [6]:
universityDataDf = universityDataDf.dropna()
universityDataDf.shape

(1326, 7)

### Save csv

In [7]:
universityDataDf.to_csv('./university_data.csv', index=False)